app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Justin Bieber"], ["created_at", "2017-03-27 21:40:18.005408"], ["updated_at", "2017-03-27 21:40:18.005408"]]
---
  def create
    @artist = Artist.new(name: artist_params[:name])
    if @artist.in_spotify?
      if @artist.save

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]
---
  def destroy
    @artist.destroy