app/controllers/songs_controller.rb

  def all
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def new
    @song = Song.new
    @song.artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 3]]